#include <iostream>
//Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.
//
//Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.
//
//Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број, во истиот редослед.
// Соодветно да се испечатат пораки „PAREN“ и „NE“.
//
//Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)

//Input
//12345678 1357
//Output
//PAREN


//Input
// 0 0
//Output
// Invalid input

//Input
// 567890 7
// NE

//Input
//15370 57
//Output
// PAREN

//Input
// 1537 57
//Output
// NE
int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
